using CommunityToolkit.Mvvm.ComponentModel;

namespace EE.Doklad.Models
{
    /// <summary>
    /// Данни за раздел №20 - "Заключение"
    /// </summary>
    public partial class ConclusionSectionData : ObservableObject
    {
        [ObservableProperty]
        private string _title = "Заключение";

        [ObservableProperty]
        private string? _description;

        /// <summary>
        /// Заключителен текст - редактируем от потребителя
        /// </summary>
        [ObservableProperty]
        private string _conclusionText = 
            "В проектът са спазени изискванията към инвестиционните проекти съгласно Наредба № РД-02-20-3 от 9 ноември 2022г. за техническите изисквания към енергийните характеристики на сгради.\n" +
            "Част \"Енергийна ефективност\" има съгласуваност с останалите части.\n" +
            "Спазена е методиката за изчисление на топлотехническите характеристики на нова сграда.\n" +
            "Изпълнението на предвидените детайли на сградните ограждащи елементи ще осигури вътрешен микроклимат в сградата, съответстващ на нейната класификация.\n" +
            "При направеното моделно изследване на енергопотреблението в сградата на база проектни данни от части: Архитектурна, Отопление и Вентилация и Ел. и на основата на метода, разработен по EN ISO 52000-1; 52003-1; 52010-1;52016-1; 52018-1 , реализирано програмно като софтуерен продукт за изчисляване на енергийни характеристики на сгради, предоставен от Агенцията по устойчиво енергийно развитие, бе констатирано, че сградата отговаря на клас на енергопотребление A.\n" +
            "Съответствието на проекта с изискванията за енергийна ефективност е изпълнено. В част \"Енергийна ефективност\" се съдържат всички необходими показатели за попълване на сертификат за проектни енергийни характеристики на сградата.";
    }
}
